import 'package:flutter/material.dart';
import 'package:flutter_linkify/flutter_linkify.dart';
import 'package:k_webpage/views/widgets/nav_bar.dart';

class ArTermsOfUse extends StatelessWidget {
  const ArTermsOfUse({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: const NavBar(
        logo: "assets/images/ar_logo.png",
        lang: "عربي",
        isEnglish: false,
      ),
      body: Padding(
        padding: const EdgeInsets.all(8.0),
        child: SingleChildScrollView(
          child: Column(
            textDirection: TextDirection.rtl,
            mainAxisAlignment: MainAxisAlignment.start,
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              const Text(
                "مقدمة",
                style: TextStyle(
                    color: Colors.black,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "مهمتنا هي تقديم رعاية صحية أفضل وبأسعار معقولة من خلال حلول البرامج والمعلومات المبتكرة لمقدمي الرعاية في جميع أنحاء سلسلة الرعاية ومرضاهم والباحثين الصحيين. تشمل حلولنا سجلنا الصحي الإلكتروني ، وإدارة الممارسات وبرنامج السجلات الصحية للمرضى ، وتنسيق رعايتنا وخدمات نقل البيانات السريرية ، وحلول أبحاث النتائج الصحية لدينا.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              RichText(
                text: TextSpan(children: [
                  const TextSpan(
                    text:
                        "تنطبق سياسة الخصوصية هذه (هذه  السياسة ) على خدمات البرامج والمعلومات التي نقدمها من خلال موقعنا الإلكتروني الموجود على",
                    style: TextStyle(color: Colors.black, fontSize: 16),
                  ),
                  WidgetSpan(
                      child: Linkify(
                    text: "www.KONSOLTO.com",
                    linkStyle:
                        const TextStyle(color: Colors.blue, fontSize: 16),
                    onOpen: (link) {
                      debugPrint("open link!");
                    },
                  )),
                  const TextSpan(
                    text:
                        "وحلول إدارة السجلات الصحية الإلكترونية والممارسات المستندة إلى مجموعة النظراء ، ورسائل البريد الإلكتروني التي تم تمكينها على الويب والتي يتم إرسالها كجزء من ، فيما يتعلق أو فيما يتعلق بهذه البرامج وخدمات المعلومات (يشار إليها مجتمعة باسم  خدماتنا ). لا تنطبق هذه السياسة على أي خدمات أخرى. الحفاظ على ثقتك أمر مهم بالنسبة لنا ، ونحن نشجعك بشدة على قراءة هذه السياسة بالكامل. ",
                    style: TextStyle(color: Colors.black, fontSize: 16),
                  ),
                ]),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "الغرض من هذه السياسة هو وصف كيفية قيامنا نحن وشركاؤنا بجمع واستخدام وتبادل المعلومات عنك. قد تصف هذه السياسة بالمصادفة كيفية قيام خدماتنا بجمع واستخدام معلومات حول أفراد آخرين أو معلومات عنك قد يتم إرسالها من قبل مستخدم آخر. ومع ذلك ، تنطبق سياسة الخصوصية هذه فقط على كيفية قيامنا نحن وشركاؤنا بجمع واستخدام ومشاركة المعلومات المتعلقة بك فيما يتعلق بالخدمات التي تغطيها شروط استخدام KONSOLTO أو اتفاقية المستخدم الخاصة بمقدم الرعاية الصحية (اتفاقية المستخدم) ، وليس إلى أي خدمة أخرى قد نقدمها لأي فرد أو عميل آخر.    ",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "المعلومات التي جمعتها خدماتنا",
                style: TextStyle(
                    color: Colors.black,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "المعلومات التي ترسلها أو نجمعها نيابة عنك :",
                style: TextStyle(
                    color: Colors.black,
                    decoration: TextDecoration.underline,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "نجمع معلومات منك عندما:",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "	•	أدخل المعلومات في خدماتنا ، على سبيل المثال عند التسجيل في خدماتنا ، أو استخدام خدماتنا لإرسال رسالة إلى شخص آخر ، أو إكمال نموذج ",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "	•	تحميل مستند أو صورة أو ملف بيانات آخر على خدماتنا ؛",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "	•	اتصل بنا؛ أو",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "	•	قدم طلبًا لخدمة العملاء أو احضر إحدى جلساتنا التدريبية الفردية أو الجماعية.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "نقوم أيضًا بجمع المعلومات نيابة عنك عندما تصرح لنا باسترداد واستيراد المعلومات من مستخدم آخر أو طرف ثالث آخر داخل خدمتنا أو على النحو المنصوص عليه في اتفاقية المستخدم.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "قد تتضمن المعلومات التي نجمعها عنك اسمك وعنوانك ورقم هاتفك وعنوان بريدك الإلكتروني أو المعلومات التي تدخلها أو تحمّلها إلى خدماتنا.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "المعلومات التي يتم جمعها تلقائيًا :",
                style: TextStyle(
                    color: Colors.black,
                    decoration: TextDecoration.underline,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "نقوم نحن وشركاؤنا بجمع المعلومات تلقائيًا عندما تزور خدماتنا أو تسجل الدخول إليها أو تتفاعل معها بطريقة أخرى ، بما في ذلك عندما تتلقى رسائل بريد إلكتروني يتم تسليمها عبر خدماتنا. نستخدم نحن وشركاؤنا التقنيات الموضحة أدناه والتقنيات المماثلة التي قد لا يتم وصفها صراحةً (والتي نطلق عليها بشكل جماعي  أدوات المشاركة ) لجمع هذه المعلومات لتعزيز خدماتنا وتشغيلها بعدة طرق ، مثل:",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "•	حفظ تفضيلات المستخدم والمعلومات ؛",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	الحفاظ على إعدادات الجلسة والنشاط ؛",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	مصادقة المستخدمين ؛",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	تمكين ميزات الدعم والأمان ؛",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	تكييف إيصال الرسائل الإعلامية والوسائط والإعلانات والمحتويات الأخرى ؛ و•	تحليل أداء واستخدام خدماتنا وميزاتها ومحتوياتها المتنوعة.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "حتى إذا لم تسجل معنا أو ترسل أي معلومات عن خدماتنا ، فستتلقى أدوات المشاركة تلقائيًا معلومات حول الكمبيوتر أو الهاتف المحمول أو الجهاز اللوحي (كل منها  جهاز ) الذي تستخدمه والبرنامج الذي يعمل عليه تتفاعل مع خدماتنا.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              RichText(
                text: const TextSpan(children: [
                  TextSpan(
                    text: "معلومات الجهاز ",
                    style: TextStyle(
                        color: Colors.black,
                        fontSize: 16,
                        decoration: TextDecoration.underline),
                  ),
                  TextSpan(
                    text:
                        "عندما تتفاعل مع خدماتنا ، فإننا نجمع معلومات حول جهازك مثل عنوان URL للخدمات التي يطلبها جهازك وصفحات الويب المُحيلة وعنوان IP الخاص بك ونوع الجهاز ونظام التشغيل ونوع المتصفح ومعرف التطبيق و ، في ظل ظروف معينة ، معلومات الموقع التي يرسلها جهازك إلينا.",
                    style: TextStyle(
                      color: Colors.black,
                      fontSize: 16,
                    ),
                  )
                ]),
              ),
              const SizedBox(
                height: 6.0,
              ),
              RichText(
                text: const TextSpan(children: [
                  TextSpan(
                    text: "ملفات تعريف الارتباط والتقنيات المشابهة ",
                    style: TextStyle(
                        color: Colors.black,
                        fontSize: 16,
                        decoration: TextDecoration.underline),
                  ),
                  TextSpan(
                    text: "",
                    style: TextStyle(
                      color: Colors.black,
                      fontSize: 16,
                    ),
                  )
                ]),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "نقوم نحن وشركاؤنا بجمع معلومات عنك وعن أجهزتك من خلال ملفات تعريف الارتباط وإشارات الويب والتقنيات المماثلة. ملف تعريف الارتباط هو ملف بيانات صغير يتم إرساله من موقع ويب ويتم تخزينه على جهازك لتحديد جهازك في المستقبل والسماح بتجربة مستخدم مخصصة محسّنة بناءً على نشاطك السابق على موقع الويب. يختفي ملف تعريف ارتباط الجلسة بعد إغلاق متصفح الويب الخاص بك ، أو قد تنتهي صلاحيته بعد فترة زمنية محددة. يبقى ملف تعريف الارتباط الدائم بعد إغلاق متصفح الويب الخاص بك ويمكن الوصول إليه في كل مرة تستخدم فيها خدماتنا. قد نستخدم نحن وشركاؤنا كلاً من ملفات تعريف الارتباط للجلسة وملفات تعريف الارتباط الدائمة على خدماتنا. يجب عليك استشارة متصفح الويب الخاص بك لتعديل إعدادات ملفات تعريف الارتباط الخاصة بك. يرجى ملاحظة أنه إذا قمت بحذف أو اختيار عدم قبول ملفات تعريف الارتباط منا ، فقد لا تتمكن من استخدام بعض ميزات خدماتنا.ينشر بعض شركائنا هذه التقنيات مباشرةً على خدماتنا. قد تجمع هذه الأطراف الثالثة معلومات بمرور الوقت حول استخدامك لخدماتنا ، بالإضافة إلى أنشطتك عبر الإنترنت عبر مواقع الويب الأخرى أو الخدمات عبر الإنترنت. قد تسمح لك بعض الجهات الخارجية بإلغاء الاشتراك في الإعلانات الموجهة بناءً على هذه المعلومات.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "معلومات من مصادر أخرى :",
                style: TextStyle(
                    color: Colors.black,
                    decoration: TextDecoration.underline,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "قد نتلقى معلومات عنك أو نجمعها بشكل استباقي من مصادر أخرى ونضيفها إلى المعلومات التي نمتلكها عنك لأي غرض موصوف في هذه السياسة. قد يشمل ذلك المواقف التي يسعى فيها طرف ثالث إلى التواصل معك من خلال الخدمات أو إنشاء تكامل (كما هو موضح بشكل أكثر تفصيلاً أدناه تحت العنوان ، عمليات تكامل الطرف الثالث ",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "كيف نستخدم المعلومات",
                style: TextStyle(
                    color: Colors.black,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const Text(
                "قد نستخدم المعلومات التي نجمعها للأغراض التالية:",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	تشغيل خدماتنا وتطوير وظائف وميزات جديدة ؛",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	الرد على الأسئلة والاتصالات ، أو الحصول على ملاحظاتك حول خدماتنا ؛",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	إدارة وتسجيل مشاركتك في البرامج التعليمية والإعلامية ، بما في ذلك الندوات عبر الإنترنت والفصول الدراسية الأخرى ، وأي منتج أو مسائل دعم قد تنشأ عن هذه البرامج ؛",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	إعداد وتقديم إعلانات حول الميزات أو الوظائف أو شروط الاستخدام أو جوانب أخرى من خدماتنا أو اهتماماتك وإبلاغك بعروض الخدمات أو المنتجات التي نعتقد أنها قد تهمك ، بما في ذلك من الجهات الراعية التابعة لجهات خارجية ؛",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	تحليل اتجاهات وأنماط الاستخدام وقياس فعالية المحتوى أو البرامج أو الإعلانات أو ميزات أو وظائف الخدمات ، بما في ذلك رسائل البريد الإلكتروني التي قد نرسلها إليك ؛",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	إعداد التقارير لأي من الأغراض الموضحة في هذه السياسة ، بما في ذلك الرعاة الحاليين أو المستقبليين أو المعلنين أو الشركاء الآخرين لإظهار الاستخدام أو الاتجاهات حول استخدام خدماتنا. قد تتضمن هذه التقارير معلومات ديموغرافية أو معلومات عامة أخرى للمستخدم ، ولكنها لن تتضمن معلومات تعريف شخصية ما لم يوافق المستلم على التزامات السرية ؛",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	حماية وحماية خدماتنا والمعلومات التي نجمعها وحقوقنا أو مستخدمينا أو الأطراف الثالثة ، واستجابة للإجراءات القانونية ؛",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	أي غرض آخر موصوف في هذه السياسة أو اتفاقية المستخدم الخاصة بك ؛ أو",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	عندما نحصل على إذن منك.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "كيف تسمح خدماتنا للمستخدمين بمشاركة المعلومات:",
                style: TextStyle(
                    color: Colors.black,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "اتصالات فردية :",
                style: TextStyle(
                    color: Colors.black,
                    decoration: TextDecoration.underline,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "يمكن استخدام خدماتنا لتسهيل الاتصالات الفردية بين المستخدمين والأشخاص الآخرين. الامثله تشمل:",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "•	إرسال تأكيد موعد أو إشعار آخر إلى مستخدم آخر ؛",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	إجراء إحالة إلى مقدم رعاية صحية آخر ؛",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	إرسال وصفة طبية إلى الصيدلية ؛",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const Text(
                "•	إرسال طلب اختبار إلى مختبر سريري ؛ أورسالة ",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "في أي اتصال فردي ، يرسل المستخدمون المعلومات إلى بعضهم البعض أو إلى فرد أو كيان قد لا يكون مستخدمًا للخدمات. اعتمادًا على الرسالة ، يمكن أن يشمل ذلك مشاركة جهة الاتصال وغيرها من معلومات التعريف الشخصية.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "الدلائل :",
                style: TextStyle(
                    color: Colors.black,
                    decoration: TextDecoration.underline,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "إذا كنت مقدم رعاية صحية أبرم اتفاقية مستخدم مقدم رعاية صحية ، فستكون لديك القدرة على إدراج معلومات الاتصال والدليل في واحد أو أكثر من الدلائل المهنية لمقدمي الرعاية الصحية في خدماتنا التي يستخدمها المستخدمون و / أو العامة قد يتمكن الجمهور من المشاهدة. تتضمن هذه الأدلة معلومات الملف الشخصي (على سبيل المثال ، جهة الاتصال والتخصص والمعلومات الأخرى) وغيرها من الميزات التي تسمح للمستخدمين و / أو الجمهور العام بتحديد موقع أولئك المدرجين في الدليل والاتصال بهم.\nإذا قمت بزيارة خدماتنا سعياً إلى الاتصال أو تحديد موعد مع مزود مدرج في أحد أدلةنا ، فقد تحتاج إلى تقديم معلومات تعريف شخصية ومعلومات أخرى.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "المنتديات العامة :",
                style: TextStyle(
                    color: Colors.black,
                    decoration: TextDecoration.underline,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "تشمل خدماتنا المنتديات العامة التي تسمح للمستخدمين بالتواصل مع مجموعات المستخدمين أو الجمهور العام. قد تكون المعلومات التي ينشرها المستخدم في أحد مجتمعاتنا متاحة لمجموعة كبيرة من الأفراد ، ويجب أن تكون عامة. ننصح المستخدمين بشدة بتوخي الحذر في اختيار المعلومات التي يشاركونها مع مجتمعاتنا أو المنتديات العامة ، ونوصي بشدة بعدم مشاركة أي معلومات شخصية أو صحية أو غيرها من المعلومات الحساسة التي يمكن تتبعها بشكل مباشر أو غير مباشر لأي فرد ، بما في ذلك أنفسهم.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "الاستطلاعات والتعليقات والبرامج الإعلامية :",
                style: TextStyle(
                    color: Colors.black,
                    decoration: TextDecoration.underline,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "من وقت لآخر ، قد تتلقى طلبات استطلاع من خلال رسائل البريد الإلكتروني أو العروض داخل خدماتنا التي تطلب ملاحظات حول مجموعة متنوعة من الموضوعات. قد يتم رعاية هذه البرامج أو تمويلها من قبل جهات خارجية ، وقد تتضمن محتوى ذا علامة تجارية أو بدون علامة تجارية حول الحالات الطبية والعلاجات والمنتجات أو موارد السلامة والمعلومات التنظيمية. إذا اخترت التعامل مع أحد هذه الطلبات أو استخدامها ، فقد يُطلب منك تقديم معلومات يمكن استخدامها لتكملة المعلومات التي قدمتها إلى خدماتنا. يمكن مشاركة هذه المعلومات مع راعي البرنامج.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "السجلات :",
                style: TextStyle(
                    color: Colors.black,
                    decoration: TextDecoration.underline,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "تتيح خدماتنا للمستخدمين تخزين معلومات التعريف الشخصية والمعلومات الصحية ( السجلات ) ، بما في ذلك السجلات التي تحدد الأفراد الآخرين ، بما في ذلك المستخدمين الآخرين. تسمح بعض خدماتنا للمستخدمين بمشاركة كل هذه السجلات أو أجزاء منها وفقًا لتقديرهم.\nيجب أن تدرك أن هذه السياسة تغطي فقط المعلومات التي ترسلها من خلال خدماتنا. إذا اتصلت أو قمت بتبادل المعلومات مع مستخدم آخر شخصيًا أو من خلال وسيلة أخرى غير خدماتنا ، فإن هذه السياسة لا تغطي هذا النشاط. نظرًا لأن خدماتنا تمكّن المستخدمين من مشاركة المعلومات التي تشاركها معهم ، يجب أن تحرص على اختيار من تشارك معهم سجلاتك والمعلومات الأخرى. على الرغم من أن خدماتنا تعالج عمليات النقل هذه ، إلا أننا لسنا مسؤولين عن تصرفات الأشخاص الذين تشارك معهم سجلاتك ومعلومات أخرى.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "رسائل البريد الإلكتروني والاتصالات الأخرى :",
                style: TextStyle(
                    color: Colors.black,
                    decoration: TextDecoration.underline,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "تتيح خدماتنا للمستخدمين التواصل مع الآخرين من خلال خدمات المراسلة الفورية داخل المنتج ورسائل البريد الإلكتروني التي تحمل علامة الخدمة وقنوات الاتصال الإلكترونية الأخرى. يشار إلى المراسلات التي يتم إرسالها من قبل أو نيابة عن المستخدم على أنها من هذا المستخدم ، مثل عندما ترسل خدماتنا إشعارًا بموعد من مقدم رعاية صحية ونيابة عنه إلى مريضه. بالإضافة إلى ذلك ، قد ننقل إعلانات إدارية أو متعلقة بالخدمة عبر البريد الإلكتروني أو وسائل الاتصال الأخرى ضمن خدماتنا. قد تكون هذه الاتصالات عبارة عن اتصالات أو اتصالات في الوقت الفعلي يتم تشغيلها تلقائيًا عند حدوث أحداث أو تواريخ معينة - مثل فشل تسجيل الدخول المتكرر أو إشعار الموعد. يرجى ملاحظة أنك قد لا تتمكن من إلغاء الاشتراك في تلقي رسائل معينة منا./nلا تغطي هذه السياسة رسائل البريد الإلكتروني والمراسلات الأخرى من الأفراد الذين ليسوا مستخدمين لخدماتنا ، أو التي نرسلها فيما يتعلق باتفاقيات العمل أو الموضوعات الأخرى بخلاف اتفاقيات المستخدم. إذا اتصلت بنا ، على سبيل المثال ، بخصوص وظيفة شاغرة ، فإن هذه السياسة لا تغطيها هذه الاتصالات على الرغم من أنه قد يكون قد تم نشر هذه الوظيفة على خدماتنا.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "تكامل الطرف الثالث",
                style: TextStyle(
                    color: Colors.black,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "قد تسمح لك خدماتنا بربط حسابك على خدماتنا بأطراف ثالثة ، على سبيل المثال عندما يسعى مقدم الرعاية الصحية إلى دمج وحدة الوصفات الإلكترونية الخاصة بنا في شبكة الوصفات الإلكترونية الوطنية لشريكنا ، أو عندما يوافق مقدم الرعاية الصحية على دمجنا أو ربطه. حساب مع برنامج فوترة خاص بطرف ثالث (أي تكامل يُشار إليه باسم  تكامل ). يمكن أيضًا بدء عمليات التكامل من قبل أطراف ثالثة تسعى إلى إنشاء عمليات تكامل معك ، مثل عندما يرغب المختبر السريري في إرسال نتائج المختبر مباشرةً إلى حساب السجل الصحي الإلكتروني لمقدم الرعاية الصحية بدلاً من إرسال النتيجة عن طريق الفاكس أو أي وسيلة أخرى. استخدامك لعمليات التكامل هذه اختياري تمامًا. إذا اخترت استخدام عمليات التكامل هذه ، فقد تتم مطالبتك بمنحنا الإذن بتنفيذ إجراءات معينة في حسابك ، مثل إنشاء معلومات معينة أو تحديثها أو حذفها. يرجى ملاحظة أنه إذا اخترت استخدام أي تكامل ، فإن أي معلومات تختار تقديمها لأطراف ثالثة ستخضع لأي اتفاق أبرمته معهم ، بما في ذلك ، إن أمكن ، شروط الاستخدام أو سياسة الخصوصية الخاصة بهم ، وليس هذه السياسة. لتعطيل التكامل ، يمكنك الاتصال",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "تبادل المعلومات",
                style: TextStyle(
                    color: Colors.black,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "يجوز لنا مشاركة المعلومات التي ترسلها إلينا مع جهات خارجية في ظل الظروف التالية:\n "
                "	عندما تختار مشاركة هذه المعلومات من خلال خدماتنا ، مثل الاتصالات الفردية بين مقدم الخدمة ومريض أو مقدم رعاية صحية آخر ؛\n "
                "	عندما يتم إصدار حسابك من قبل مسؤول حساب لديه حقوق إدارية على حسابك ، فسيكون لمسؤول حسابك حق الوصول إلى معلومات حسابك ؛\n 	مع مزودي الخدمة من الأطراف الثالثة الذين وافقوا على التزامات السرية ، والتي قد تشمل ، حسب الاقتضاء ، التزامات عقد شركاء الأعمال ؛\n •"
                "	إذا كنت مقدم رعاية صحية أبرم اتفاقية مستخدم مقدم رعاية صحية ، فقد نشارك المعلومات مع الأطراف الثالثة الخاضعة لالتزامات السرية التي اخترتها لتأسيس عمليات تكامل معك ، أو تسعى إلى إقامة تكامل معك ، و تسهيل وصيانة ومراقبة استخدام عمليات التكامل هذه ؛\n	"
                "إذا كنت أحد مقدمي الرعاية الصحية الذين أبرموا اتفاقية مستخدم لمقدم الرعاية الصحية ، فقد نشارك المعلومات أيضًا مع أطراف ثالثة تخضع لالتزامات السرية التي تمول أو تدير محتوى معينًا ذا علامة تجارية أو بدون علامة تجارية حول الحالات الطبية والعلاجات والمنتجات أو السلامة وموارد المعلومات التنظيمية ، مثل أدوات دعم القرار السريري ، وعروض مدخرات المرضى ، وبرامج التعويض أو الخصم المشترك في الدفع ، وبرامج الالتزام بالأدوية ، وغيرها من البرامج المماثلة ، ومع ظهور رعاة الإعلانات ضمن خدماتنا. قد تشمل أغراض هذه المشاركة التزامات الإدارة أو حفظ السجلات أو الامتثال وتقييم فعالية أو استخدام أي برنامج من هذا القبيل.\n	إذا تلقيت أي أتعاب أو مدفوعات فيما يتعلق باستطلاع أو طلب للتعليق ، فقد تتم مشاركة معلوماتك مع مصدر التمويل أو الراعي لهذا الاستطلاع أو البرنامج ؛\n•	لحماية خدماتنا والمعلومات التي نجمعها وحقوقنا ومستخدمينا وأي طرف ثالث ، بما في ذلك التحقق من هويتك ؛\n•"
                "	لاكتشاف أو منع أو التحقيق أو معالجة الاحتيال أو النشاط غير القانوني أو انتهاكات شروطنا واتفاقياتنا ؛\n 	"
                "استجابة للإجراءات القانونية ، مثل أمر تفتيش أو أمر محكمة أو أمر استدعاء ، أو عندما يكون لدينا اعتقاد حسن النية أن القانون يتطلب منا القيام بذلك ؛\n	مع شركاتنا الفرعية الحالية والمستقبلية أو الشركات التابعة أو المستثمرين الفعليين أو المحتملين ؛\n "
                " 	فيما يتعلق بالبيع المحتمل أو الفعلي ، أو الاندماج ، أو النقل ، أو التبادل ، أو إعادة التنظيم ، أو أي تصرف آخر (سواء في الأصول ، أو الأسهم ، أو غير ذلك) لكل أو جزء من الأعمال التي تجريها خدماتنا. في حالة حدوث مثل هذه المعاملة ، سيظل استخدام الشركة المستحوذة لمعلوماتك خاضعًا لهذه السياسة ، كما قد يتم تعديلها لاحقًا ؛\n	أي أغراض أخرى موصوفة في هذه السياسة أو اتفاقية المستخدم الخاصة بك ؛ أو\n•	عندما نحصل على إذن منك.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "حماية",
                style: TextStyle(
                    color: Colors.black,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "للمساعدة في منع الوصول غير المصرح به والحفاظ على دقة البيانات والحماية من الاستخدام غير المناسب للمعلومات التي نجمعها ونخزنها وننقلها ، فإننا ننشر مجموعة من الضمانات التقنية والمادية والإدارية. تحت لدينا اتفاق الرعاية الصحية مزود العضو والقانون الواجب التطبيق، فنحن مطالبون بتطبيق التدابير المعقولة والمناسبة لضمان السرية والسلامة، وتوافر المعلومات الصحية يمكن تحديدها بشكل فردي يقيمون عليها، ومعالجتها من قبل، تلك العناصر من خدماتنا التي نعمل فيها كما شريك أعمال نيابة عن مقدمي الرعاية الصحية. من المهم أن تتذكر ، مع ذلك ، أنه لا يوجد نظام يمكنه ضمان أمان بنسبة 100٪ في جميع الأوقات. وفقًا لذلك ، لا يمكننا ضمان أمان المعلومات المخزنة على خدماتنا أو المنقولة إليها أو منها.  ",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "خدمات الطرف الثالث",
                style: TextStyle(
                    color: Colors.black,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "تنطبق هذه السياسة فقط على خدماتنا. لا تنطبق على الخدمات التي تقدمها الجهات الخارجية ، بما في ذلك مواقع الويب والخدمات الأخرى عبر الإنترنت التي قد تعرض خدماتنا روابط لها أو للإعلانات التي تظهر داخل الخدمات. عند النقر فوق مثل هذه الروابط أو الإعلانات ، ستزور مواقع الويب أو الخدمات التفاعلية التي تديرها جهات خارجية ، والتي لديها ممارساتها الخاصة في جمع المعلومات ، وقد تقوم أيضًا بجمع المعلومات من خلال استخدام أدوات المشاركة. ليس لدينا سيطرة على كيفية قيام أي طرف ثالث بجمع المعلومات أو استخدامها ، لذلك يجب عليك مراجعة سياسات الخصوصية الخاصة بهم للتعرف على ممارساتهم.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "التغييرات في هذه السياسة",
                style: TextStyle(
                    color: Colors.black,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "نحن نؤمن بالابتكار المستمر ، والذي ، إلى جانب التغييرات في أعمالنا ، قد يتطلب منا تعديل هذه السياسة من وقت لآخر. سننشر سياسة منقحة مع تاريخ نفاذها على هذه الصفحة. نظرًا لإمكانية تغيير هذه السياسة في أي وقت ، فإننا نشجعك على إعادة قراءتها بشكل دوري لمعرفة ما إذا كانت هناك أية تغييرات أو تعديلات أو تحديثات. إذا كنت تعترض على التغييرات أو أي شروط واردة في هذه السياسة أو اتفاقيات المستخدم ، فيجب عليك التوقف عن استخدام خدماتنا. استمرار استخدامك لخدماتنا بعد تاريخ السريان يعني أنك قد وافقت على السياسة ، بصيغتها المعدلة أو المتغيرة أو المحدثة",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "عرض وتحديث المعلومات الخاصة بك",
                style: TextStyle(
                    color: Colors.black,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "تهدف خدماتنا إلى تزويدك بإمكانية الوصول إلى المعلومات التي ترسلها ووسائل تحديثها ضمن خدماتنا بما يتوافق مع القانون المعمول به. يمكن تحقيق ذلك عن طريق تسجيل الدخول إلى خدماتنا وتحديث تلك المعلومات ، أو الاتصال بممثل دعم العملاء ، على الرغم من برجاء العلم بالقيود المهمة الموضحة أدناه. في ظل ظروف معينة ، قد نطلب منك التحقق من هويتك قبل معالجة طلبك.\n يرجى ملاحظة أنه ما لم تكن لديك حقوق إدارية على حساب مستخدم آخر وفقًا لاتفاقية مستخدم مقدم الرعاية الصحية ، فلا يحق لك الوصول إلى محتوى حساب مستخدم آخر أو تحديثه أو حذفه.إذا استخدمت خدماتنا لمشاركة المعلومات مع مستخدم آخر أو طرف ثالث ، فلن تتمكن من الوصول إلى هذه المعلومات المشتركة أو تحديثها أو حذفها\n. علاوة على ذلك ، إذا قدم مستخدم آخر لخدماتنا معلومات تحدد هويتك ، فلن تتمكن من الوصول إلى هذه المعلومات أو تحديثها أو حذفها.\nقد يُطلب من بعض المستخدمين - مثل مقدمي الرعاية الصحية - بموجب القوانين أو اللوائح المعمول بها الاحتفاظ بمعلومات عنك لفترات طويلة من الوقت أو إلى أجل غير مسمى. بالإضافة إلى ذلك ، قد تكون لدينا التزامات مستقلة بموجب القوانين أو اللوائح المعمول بها للاحتفاظ بهذه المعلومات إلى أجل غير مسمى. أخيرًا ، لأغراض التعافي من الكوارث واستمرارية الأعمال ، نحتفظ بنسخ من البيانات المخزنة بواسطة خدماتنا لفترات زمنية غير محددة.",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "اتصل بنا",
                style: TextStyle(
                    color: Colors.black,
                    fontWeight: FontWeight.w500,
                    fontSize: 22),
              ),
              const SizedBox(
                height: 6.0,
              ),
              const Text(
                "إذا كانت لديك أسئلة بخصوص هذه السياسة ، فيرجى الاتصال بنا على\nadham@konsolto.com\n388 عمارات النرجس ، التجمع الخامس ، القاهرة الجديدة ، مصر",
                style: TextStyle(color: Colors.black, fontSize: 16),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
